sys/207.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">
          
      <input>
                &lt;SYSMessage&gt;
                    &lt;messageGuid value="<%=messageGuid %>" /&gt;
                    &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="207" value="Asi Veri Seti" /&gt;
                    &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
            &lt;author&gt;
            &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
            &lt;/author&gt;
            &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
            &lt;recordData&gt;
            &lt;ASI_VERI_SETI&gt;
            &lt;ASI_BILGISI&gt;

                
            <%if(ASI_OZEL_DURUM_NEDENI!=-1){ %>
                &lt;ASI_OZEL_DURUM_NEDENI version="1" codeSystemGuid="0a8f681f-4ed0-4830-9dc9-a0295686398b" code="<%=ASI_OZEL_DURUM_NEDENI.KODU %>" value="<%=ASI_OZEL_DURUM_NEDENI.ADI %>"/&gt;
            <% }%>
            &lt;ASI version="1" codeSystemGuid="c3dbbb53-3b59-06e1-e043-14031b0a9fe6" code="<%=ASI.KODU %>" value="<%=ASI.ADI %>" /&gt;
            &lt;ASI_DOZU version="1" codeSystemGuid="da92a50e-b1a8-4e6a-be8c-2b6ca2c0a58b" code="<%=ASI_DOZU.KODU %>" value="<%=ASI_DOZU.ADI %>" /&gt;
            &lt;ASININ_UYGULAMA_SEKLI version="1" codeSystemGuid="f20210e0-d780-4961-87eb-3323000b7dbb" code="<%=ASININ_UYGULAMA_SEKLI.KODU %>" value="<%=ASININ_UYGULAMA_SEKLI.ADI %>" /&gt;
            &lt;ASININ_UYGULAMA_YERI version="1" codeSystemGuid="eb66330f-2b96-40a7-931e-fc9aed2b9409" code="<%=ASININ_UYGULAMA_YERI.KODU %>" value="<%=ASININ_UYGULAMA_YERI.ADI %>" /&gt;
            <%if(ASI_ISLEM_TURU.KODU=1){ %>
                  &lt;ASI_SORGU_NUMARASI value="<%=ASI_SORGU_NUMARASI %>" /&gt;
            <% }%>
            <%if(ASI_ISLEM_TURU.KODU==2){ %>
                &lt;ISLEM_YAPAN value="<%=ISLEM_YAPAN %>" /&gt;
                &lt;BILGI_ALINAN_KISI_ADI_SOYADI value="<%=BILGI_ALINAN_KISI_ADI_SOYADI %>" /&gt;
                &lt;BILGI_ALINAN_KISI_TEL value="<%=BILGI_ALINAN_KISI_TEL %>" /&gt;
                &lt;IZLEMIN_YAPILDIGI_YER version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=IZLEMIN_YAPILDIGI_YER.KODU %>" value="<%=IZLEMIN_YAPILDIGI_YER.ADI %>" /&gt;
            <% }%>
            <%if(ASI_ISLEM_TURU.KODU==1){ %>
                &lt;ISLEM_YAPAN value="" /&gt;
                &lt;BILGI_ALINAN_KISI_ADI_SOYADI value="" /&gt;
                &lt;BILGI_ALINAN_KISI_TEL value="" /&gt;
                &lt;IZLEMIN_YAPILDIGI_YER version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=IZLEMIN_YAPILDIGI_YER.KODU %>" value="<%=IZLEMIN_YAPILDIGI_YER.ADI %>" /&gt;
            <% }%>
                  
            &lt;ASI_YAPILMA_ZAMANI value="<%=ASI_YAPILMA_ZAMANI %>" /&gt;
            &lt;ASI_ISLEM_TURU version="1" codeSystemGuid="5fff8778-89a4-4045-b33e-a7ffe0de0179" code="<%=ASI_ISLEM_TURU.KODU %>" value="<%=ASI_ISLEM_TURU.ADI %>" /&gt;

                    &lt;/ASI_BILGISI&gt;
              
                &lt;/ASI_VERI_SETI&gt;
                                &lt;HASTA_TAKIP_BILGISI&gt;
                                &lt;SYSTakipNo value="<%=SYSTakipNo %>" /&gt;
                                &lt;/HASTA_TAKIP_BILGISI&gt;
                                &lt;/recordData&gt;
                                &lt;/SYSMessage&gt;
                               </input>
                            </SYSSendMessage>
                            </s:Body>
                    </s:Envelope>                  
            

